Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེས་སེམས་ཅན་དེ་དག་གི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དེས་ཡང་དག་པར་བསྡུས་ཏེ། ཐབས་མཁས་པས་ཐེག་པ་གསུམ་ལ་རབ་ཏུ་འཇོག་གོ །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ།
en: They gather beings with their perfection of generosity, and establish them in the three vehicles with their skillful means.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །རབ་འབྱོར་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of generosity in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned. “

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ།
en: Subhūti, if you ask how, when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of ethical discipline, starting from the time when they first begin to set their mind on enlightenment with a mind that is devoid of concepts, in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they do complete the perfection of ethical discipline, starting from the time when they first begin to set their mind on enlightenment with a mind that is devoid of concepts, in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །དེ་ལ་འཕགས་པའི་ཚུལ་ཁྲིམས་ཟག་པ་མེད་པ་ལམ་གྱི་ཁོངས་སུ་ཆུད་པ་ཆོས་ཉིད་ཀྱིས་ཐོབ་པ་རབ་ཏུ་འཐོབ་སྟེ། དེའི་ཚུལ་ཁྲིམས་དེ་ནི་མ་ཞིག་པ་ཡིན། མ་གོད་པ་ཡིན། མ་འདྲེས་པ་ཡིན།
en: They acquire the ethical discipline of the noble ones, which is included within the uncontaminated path and acquired on the basis of the true nature.

source: རྙོག་པ་མེད་པ་ཡིན། མ་ཉམས་པ་ཡིན། རང་དབང་ཡོད་པ་ཡིན། ཤིན་ཏུ་རྫོགས་པ་ཡིན། མཁས་པས་བསྟོད་པ་ཡིན་ཏེ། ཚུལ་ཁྲིམས་དེས་གཟུགས་སམ།
en: Their ethical discipline is unimpaired, untainted, unadulterated, unsullied, undiminished, independent, utterly perfect, and praised by the learned.

source: ཚོར་བ་འམ། འདུ་ཤེས་སམ། འདུ་བྱེད་དམ། རྣམ་པར་ཤེས་པ་འམ། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་བར་རམ། རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་སམ། བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བའི་རིགས་སམ། ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བའི་རིགས་སམ། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་སམ། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་།
en: They do not seize on anything at all that may be acquired on the basis of that ethical discipline, including physical forms, feelings, perceptions, formative predispositions, consciousness, and [the causal and fruitional attributes], up to and including the thirty-two major marks of a great person {Ki.

source: ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། འབྲས་བུ་ཆེ་བ་དང་། འདུ་ཤེས་མེད་པའི་ལྷ་རྣམས་སམ། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། ཤིན་ཏུ་མཐོང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་སམ། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་སམ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་འམ། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འམ། དགྲ་བཅོམ་པ་ཉིད་དམ། རང་སངས་རྒྱས་སམ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་དབང་། ཚུལ་ཁྲིམས་འདིས་ཐོབ་པར་བྱའོ།
en: VII: 20} and the excellent eighty minor marks, as well as the great and lofty royal families, the great and lofty priestly families, and the great and lofty householder families; the gods of the Caturmahā­rāja­kāyika realm; the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, and the nonperceptual realms; the gods of Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha; the gods of the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception; and the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, and the authority of a universal emperor.

source: །ཞེས་ཆོས་གང་ལ་ཡང་སྙེམས་པ་མེད་དོ། །གཞན་དུ་ན་ཚུལ་ཁྲིམས་དེ་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མཚན་མ་མེད་པའི་ཡོངས་སུ་བསྔོ་བ་དང་། དམིགས་སུ་མེད་པ་དང་། གཉིས་སུ་མེད་པའི་ཡོངས་སུ་བསྔོ་བས་ཡོངས་སུ་བསྔོ་སྟེ།
en: In addition, making common cause with all beings, they dedicate this ethical discipline to all-aspect omniscience by means of a signless dedication and an unapprehended and nondual dedication, on the basis of worldly convention rather than ultimate reality. “

source: དེ་ཡང་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུའི་དོན་དམ་པར་ནི་མ་ཡིན་ནོ། །དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པ་དེ་དང་། ཐབས་མཁས་པས་རོ་མྱོང་བ་མེད་པའི་ཚུལ་གྱིས་བསམ་གཏན་བཞི་སྒྲུབ་བོ།
en: After completing the perfection of ethical discipline, through skillful means they attain the four meditative concentrations without relishing them.

source: །དེ་ལྷའི་མིག་མངོན་པར་སྒྲུབ་སྟེ།
en: They attain divine clairvoyance.

source: ལྷའི་མིག་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བ་དེས། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པ་དེ་དག་ཐམས་ཅད་མཐོང་སྟེ།
en: Through the maturation of this divine clairvoyance they see all the lord buddhas, as many as are alive and present, teaching the Dharma in the immeasurable, countless, and inestimable world systems of the eastern direction.

source: དེའི་མཐོང་བ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ཆུད་ཟ་བར་མི་འགྱུར་རོ། །ལྷའི་མིག་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བ་དེས། ལྷོ་དང་ནུབ་དང་བྱང་དང་། བྱང་ཤར་དང་ཤར་ལྷོ་དང་།
en: Such visions are not squandered until they have themselves attained consummate buddhahood in unsurpassed, complete enlightenment.

source: ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པ་དེ་དག་ཐམས་ཅད་མཐོང་སྟེ།
en: Through the maturation of this divine clairvoyance they also see all the lord buddhas, as many as are alive and present, teaching the Dharma in the immeasurable, countless, and inestimable world systems of each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith.

source: དེའི་མཐོང་བ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ཆུད་ཟ་བར་མི་འགྱུར་རོ།
en: Such visions are not squandered until they have themselves attained consummate buddhahood in unsurpassed, complete enlightenment. “

source: །དེ་ལྷའི་རྣ་བའི་ཁམས་རྣམ་པར་དག་པ་མི་ལས་འདས་པས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་གསུངས་པའི་སྒྲ་ཐོས་ཏེ།
en: With pure divine clairaudience, surpassing that of human beings, they hear the words spoken by those lord buddhas.

source: དེའི་ཐོས་པ་དེ་ཡང་ཇི་སྲིད་དུ་ཐོབ་པ་དེས་བདག་དང་། གཞན་གྱི་དོན་བྱས་པར་མ་གྱུར་གྱི་བར་དུ་ཆུད་ཟ་བར་མི་འགྱུར་རོ།
en: They will not squander that which they have heard until, through that which they have heard, they have acted for the benefit of themselves and others. “

source: །སེམས་ཀྱི་རྣམ་པ་ཤེས་པས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཐུགས་སེམས་ཀྱིས་རབ་ཏུ་ཤེས་ཏེ།
en: With consciousness of the thoughts [of others], their thoughts know the minds of those lord buddhas.

source: དེས་སེམས་ཀྱི་རྣམ་པ་ཤེས་པ་དེ་ཡང་ཇི་སྲིད་དུ་སེམས་ཀྱི་རྣམ་པ་ཤེས་པ་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བྱས་པར་མ་གྱུར་གྱི་བར་དུ་ཆུད་ཟ་བར་མི་འགྱུར་རོ། །དེ་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཤེས་པས།
en: They will not squander that consciousness of the thoughts [of others] until they have acted for the benefit of all beings. {

source: སེམས་ཅན་དེ་དག་གི་འདས་པ་དང་།
en: Ki.

source: མ་འོངས་པའི་དགེ་བའི་རྩ་བ་རྣམས་ཤེས་ཤིང་། དགེ་བའི་རྩ་བ་དེ་དག་གིས་སེམས་ཅན་དེ་དག་ལ་ཡང་དག་པར་སྟོན་ཏོ། །ཡང་དག་པར་བསལ་ལོ། །ཡང་དག་པར་གཟེང་བསྟོད་དོ། །ཡང་དག་པར་དགའ་བར་བྱེད་དོ། །དེ་དག་དེ་ལྟར་ཡང་དག་པར་བསྟན་པ་དང་། ཡང་དག་པར་དགའ་བའི་བར་དུ་བྱས་པ་རྣམས་ཀྱང་ཁྱད་པར་དུ་འདོད་པར་འགྱུར་རོ།
en: VII: 21} “With knowledge of the recollection of past lives, they know the past and future roots of the virtuous action of beings, and they reveal and elucidate them to those beings, encouraging them and rejoicing in them, so that these beings come to wish in particular for that which has been revealed, [and so forth], up to and including that in which they rejoice. “

source: །ཟག་པ་ཟད་པའི་ཤེས་པས་ཀྱང་སེམས་ཅན་རྣམས། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ལ་རབ་ཏུ་གཞོག་གོ །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ལ་རབ་ཏུ་གཞོག་གོ །
en: With knowledge that contaminants have ceased, they establish beings in the fruit of entering the stream to nirvāṇa, and they establish them in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and in arhatship.

source: རང་བྱང་ཆུབ་ལ་རབ་ཏུ་གཞོག་གོ །བྱང་ཆུབ་ལ་རབ་ཏུ་གཞོག་གོ །
en: They establish them in individual enlightenment, and they establish them in enlightenment.

source: དེ་བཞིན་དུ་སེམས་ཅན་རྣམས་དགེ་བའི་ཆོས་གང་དང་གང་ལ་མཐུ་ཡོད་པ་དེ་དང་དེ་ལ་རབ་ཏུ་གཞོག་སྟེ། རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་།
en: Similarly, they establish beings in those roots of virtuous action that accord with their capacities. “

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་།
en: Subhūti, so it is that when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of ethical discipline with a mind that is devoid of concepts, in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned. “

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ། འདི་ལྟ་སྟེ། གནོད་པ་ལ་མི་མཇེད་པའི་བཟོད་པ་དང་། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་གཉིས་སྒོམ་སྟེ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གནོད་པ་ལ་མི་མཇེད་པའི་བཟོད་པ་ནི།
en: Subhūti, if you ask how, when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of tolerance with a mind that is devoid of concepts in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom with a mind that is devoid of concepts in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned, they cultivate both the tolerance that patiently endures afflictions and the acceptance that phenomena are nonarising, starting from the time when they first begin to set their mind on enlightenment until they are seated at the site of enlightenment.

source: དེའི་དྲུང་དུ་སེམས་ཅན་ཐམས་ཅད་ཡང་དང་ཡང་འོངས་ཏེ། གཤེ་ཞིང་མི་སྙན་པར་བརྗོད་དེ། རྡོ་བ་དང་། དབྱིག་པས་བརྡེགས་ཤིང་། མཚོན་གྱིས་བཏབ་ཀྱང་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འཁྲུག་པ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་འགའ་ཙམ་གྱི་གོ་སྐབས་ཀྱང་མི་དབྱེའོ།
en: In this regard, the tolerance of bodhisattva great beings that patiently endures afflictions is such that even though all beings might repeatedly approach them, scolding them, speaking unpleasant words, beating them and hitting them with clods and sticks, and striking them with weapons, those bodhisattva great beings will not allow any opportunity for even a single thought of agitation to arise.

source: །དེས་འདི་ལྟར་བརྟག་པར་བྱ་སྟེ། དེ་ལ་གང་སྤྱོ་བ་དང་། མི་སྙན་པར་སྨྲ་བར་བྱ་བ་དང་། གང་བཅིང་བརྡེག་པར་བྱ་བ་གང་ཡང་མེད།
en: They should reflect as follows: ‘There is no one at all who abuses me and speaks unpleasant words, or who binds and beats me.

source: གང་ལ་གཤེ་བ་དང་། མི་སྙན་པར་བརྗོད་པ་དང་། བརྡེག་པ་དང་།
en: Nor is there anyone who is being scolded, addressed with unpleasant words, beaten, or hit.

source: འདེབས་པ་དེ་ཡང་མེད་ཅིང་མི་དམིགས་སོ་ཞེས་བྱ་བར་བརྟག་པར་བྱའོ།
en: No such person is apprehended.’

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ལ་རྟོག་ན། ཆོས་ཉིད་ཀྱང་མི་དམིགས་ན། ཆོས་རྣམས་ཀྱི་རང་བཞིན་དམིགས་པ་ལྟ་ག་ལ་ཡོད་དེ།
en: As for the acceptance of bodhisattva great beings that phenomena are nonarising, when bodhisattva great beings reflect on the essential nature of all phenomena, they do not even apprehend reality, so how could they possibly apprehend the inherent nature of phenomena!

source: དེས་དེ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་བོ།
en: It is because they do not observe the essential nature of all phenomena that they acquire the acceptance that phenomena are nonarising.

source: །ཅིའི་ཕྱིར་བཟོད་པ་ཞེས་བྱ་ཞེ་ན། ཉོན་མོངས་པ་མི་སྐྱེ་བ་དང་། ཡེ་ཤེས་མི་ཆོད་པའི་ཕྱིར་བཟོད་པ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པའོ། །དེ་བཟོད་པ་དེ་གཉིས་ལ་གནས་ཤིང་བསམ་གཏན་བཞི་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །ཚད་མེད་པ་བཞི་དང་།
en: If you ask why they are said to be tolerant, they are tolerant because afflictive mental states do not arise and because wisdom is not cut off.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་།
en: These constitute the acceptance that phenomena are nonarising.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: Abiding in these two aspects of tolerance and acceptance, they complete the four meditative concentrations, and they complete the four immeasurable attitudes, the four formless absorptions, the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, {Ki.

source: གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: VII: 22} the seven branches of enlightenment, the noble eightfold path, the three gateways of liberation, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas.

source: །དེ་འཕགས་པའི་ཆོས་ཟག་པ་མེད་པ་འཇིག་རྟེན་ལས་འདས་པ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པ་དེ་དག་ལ་གནས་ཏེ། འཕགས་པའི་མངོན་པར་ཤེས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །མངོན་པར་ཤེས་པ་དེ་དག་ཡོངས་སུ་རྫོགས་ནས།
en: Abiding in these attributes of the noble ones, which are uncontaminated, supramundane, and not common to all the śrāvakas and pratyekabuddhas, they complete the extrasensory powers of the noble ones. “

source: ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་། མངོན་པར་ཤེས་པ་ལྔ་པོ་དེ་དག་ལ་གནས་ཏེ། ལྷའི་མིག་གིས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པ་དེ་དག་ཐམས་ཅད་མཐོང་སྟེ།
en: Having completed the extrasensory powers, they dwell in the six perfections and in those five extrasensory powers: through divine clairvoyance they see all the lord buddhas, as many as are alive and present, teaching the Dharma in the immeasurable, countless, and inestimable world systems of the eastern direction.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་མཐོང་ནས། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་འཐོབ་བོ། །དེའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དེ་ཡང་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་རྒྱུན་མི་འཆད་དོ།
en: Having seen all these lord buddhas, they acquire the recollection of the buddhas, and their recollection of the buddhas will never be interrupted until they have attained consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་འཕགས་པའི་ཆོས་ཟག་པ་མེད་པ་འཇིག་རྟེན་ལས་འདས་པ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ཐུན་མོང་མ་ཡིན་པ་དེ་དག་ཐམས་ཅད་ལ་གནས་ཏེ། འཕགས་པའི་ཆོས་མངོན་པར་ཤེས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །མངོན་པར་ཤེས་པ་དེ་དག་ཡོངས་སུ་རྫོགས་ནས།
en: Abiding in all these attributes of the noble ones, which are uncontaminated, supramundane, and not common to the śrāvakas and pratyekabuddhas, they complete the extrasensory powers that are the attributes of the noble ones. “

source: ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་། མངོན་པར་ཤེས་པ་ལྔ་པོ་དེ་དག་ལ་གནས་ཏེ། ལྷའི་མིག་གིས་ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད། ཚད་མེད།
en: Having completed the extrasensory powers, they dwell in the six perfections and in those five extrasensory powers, and through divine clairvoyance they see all the lord buddhas, as many as are alive and present, teaching the Dharma in the immeasurable, countless, and inestimable world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith.

source: དཔག་ཏུ་མེད་པ་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་མཐོང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་མཐོང་ནས། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་འཐོབ་བོ། །དེའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དེ་ཡང་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་རྒྱུན་མི་འཆད་དོ།
en: Having seen these lord buddhas, they acquire the recollection of the buddhas, and their recollection of the buddhas will never be interrupted until they have attained consummate buddhahood in unsurpassed, complete enlightenment. “

source: །དེ་ལྷའི་རྣ་བ་མི་ལས་འདས་པས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་གསུངས་པ་ཐོས་ཏེ། ཐོས་ནས་ཀྱང་འཛིན་ཏེ། བཟུང་ནས་ཀྱང་དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བྱེད་དོ།
en: Through divine clairaudience, surpassing that of human beings, they hear the words spoken by those lord buddhas, and having heard them, they retain them, and having retained them, they emphasize the real nature.

source: །དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བྱས་ནས་ཀྱང་། དེ་བཞིན་ཉིད་དུ་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །དེ་སེམས་ཀྱི་རྣམ་གྲངས་ཤེས་པས།
en: Having emphasized the real nature, they also then teach the Dharma to beings in accordance with the real nature. “

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཐུགས་སེམས་ཀྱིས་རབ་ཏུ་ཤེས་སོ། །འཕགས་པ་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: Through knowledge of the thought patterns [of others], their thoughts know the minds of those lord buddhas, and they also know the mindsets of all noble ones, all the śrāvakas and pratyekabuddhas, and all beings.

source: །དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས། སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་པར་བྱས་ཤིང་། དེ་བཞིན་ཉིད་དུ་ཆོས་སྟོན་ཏོ།
en: Having comprehended with their thoughts the mindsets of all beings, they teach the Dharma in accordance with the real nature. “

source: །དེ་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པས། སེམས་ཅན་དེ་དག་གི་སྔོན་གྱི་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་ཤེས་པར་བྱས་ཤིང་། ཡང་སེམས་ཅན་དེ་དག་ལ་དགེ་བའི་རྩ་བ་ཡང་དག་པར་སྟོན་ཏོ། །ཡང་དག་པར་བསྐུལ་ལོ། །ཡང་དག་པར་གཟེང་བསྟོད་དོ།
en: Through knowledge of the recollection of past lives, they comprehend the roots of virtuous action of beings, and they also reveal them to those beings, encouraging them, praising them, and rejoicing in them. “

source: །ཡང་དག་པར་དགའ་བར་བྱེད་དོ། །དེ་ཟག་པ་ཟད་པ་ཤེས་ཏེ། ཟག་པ་ཟད་པ་ཤེས་པ་དེས། སེམས་ཅན་རྣམས་ཐེག་པ་གསུམ་ལ་རབ་ཏུ་འགོད་དོ།
en: As for knowledge that contaminants have ceased, through knowledge that contaminants have ceased, they establish beings in the three vehicles. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of tolerance with a mind that is devoid of concepts in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned.

source: མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས། དེ་ལྟར་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: These bodhisattva great beings practice the perfection of wisdom.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ།
en: They bring beings to maturity and refine the buddhafields.

source: །དེ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སྤྱད།
en: Having brought beings to maturity and refined the buddhafields, they conduct themselves in all-aspect omniscience.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Having perfected all-aspect omniscience, they attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་རོ།
en: Having attained consummate buddhahood in unsurpassed, complete enlightenment, they turn the wheel of the Dharma.

source: །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས། སེམས་ཅན་རྣམས་ཐེག་པ་གསུམ་གྱིས་འཁོར་བ་ལས་ཡོངས་སུ་འགྲེལ་ཏོ། །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ།
en: Having turned the wheel of the Dharma, they liberate beings from cyclic existence by means of the three vehicles. “

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ནོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་།
en: Subhūti, so it is that when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of tolerance in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned. {

source: འབྱུང་བ་མེད་པ་དང་།
en: Ki.
